package ch2_객체지향.Ex16_객체지향이란;

public class Ex16_4_설계하는방법 {
/*  클래스를 한덩어리 만들어서 다 때려박기. (이렇게 하면 객체지향이라는 말이 필요 없음)
    별도의 클래스에 공통되는 속성,기능들을 값 없이 선언만 해놓기
    메인에서 별도의 클래스를 인스턴스화 하고, 값을 넣거나 빼오면 됨

    설계시 가장 중요한것은 고객의 '요구사항 분석 및 정의' 다.
    우리가 만들 프로그램에 어떤 속성과 기능이 필요한지 도출할수 있다.

    예를들어, 우리가 자판기 만드는 공장이라고 치고(커피,음료,과자,꽃 같은 다양한 종류의 자판기 공장)
    자판기에 필요한 기능('돈 넣기', '잔액표시', '버튼선택', '물건 내뱉기', '거스름도 주기')들을 메서드로 만들면 됨

    별도로 기능들을 위한 객체('돈 투입구', '돈 통', '액정', '버튼', '상품', '상품 통', '상품 배출통',... ,'자판기')가 뭐가 있는지 분석하고
    인스턴스화 해서 다른 제품(클래스,객체)에서 사용할수 있도록 한다. 그러면 추후 다른 곳(클래스)에서도 그 클래스들을 인스턴스화 해서 사용할 수 있다.

* */


}